# Current Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ConduitSizeIterator..::..Current Property
ConduitSizeIterator Class See Also
---
Gets the item at the current position of the iterator.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual ConduitSize Current { get; }
```

Visual Basic
---
```text
Public Overridable ReadOnly Property Current As ConduitSize
	Get
```

Visual C++
---
```text
public:
virtual property ConduitSize^ Current {
	ConduitSize^ get ();
}
```

# ### Implements
IEnumerator<(Of <(<'T>)>)>..::..Current
# Remarks
There is no current item if the iterator has not started yet or has been done.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | There is no current item in the iterator. |

# See Also
ConduitSizeIterator Class
Autodesk.Revit.DB.Electrical Namespace